package instructions

import (
	"../../types"
	"../runtime"
	"../../utils"
		)

type I_arraylength struct {
}

func init()  {
	INSTRUCTION_MAP[0xbe] = &I_arraylength{}
}

func (s I_arraylength)Stroke(ctx *runtime.Context) error {
	utils.Log(1, "arraylength exce >>>>>>>>>\n")

	ref, _ := ctx.CurrentFrame.PopFrame()

	len := len(ref.(*types.Jarray).Reference.([]interface{}))

	ctx.CurrentFrame.PushFrame(len)

	return nil
}

func (s I_arraylength)Test() *runtime.Context {

	var a []interface{}
	a = append(append(append(a, 1), 2), 4)
	f1 := new(runtime.Frame)
	f1.PushFrame(&types.Jarray{
		Reference: a,
	})


	return &runtime.Context{
		PC: 2,
		Code: []byte{0x2},
		CurrentFrame: f1,
	}
}
/**
======================================================================================
		操作				||		取数组长度
======================================================================================
						||		arraylength
						||------------------------------------------------------------
						||
						||------------------------------------------------------------
						||
		格式				||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
======================================================================================
		结构				||		arraylength = 190(0xbe)
======================================================================================
						||		...，arrayref →
	   操作数栈			||------------------------------------------------------------
						||		...，length
======================================================================================
						||		
						||
						||		arrayref 必须是指向数组的 reference 类型的数据，指令执行时， arrayref 从操作数栈中出栈，
						||		数组的长度 length 将被计算出来并作为一个 int 类型数据压入到操作数栈中。
		描述				||
						||
						||
						||
						||
======================================================================================
						||		
						||
						||
	   链接时异常			||
						||		
						||		
						||		
======================================================================================
						||
						||
	   运行时异常			||		如果 arrayref 是 null，arraylength 将会抛出 NullPointerException 异常。
						||
						||
======================================================================================
						||
						||
						||
		注意				||
						||
						||
						||
======================================================================================
 */