package instructions

import (
	"../runtime"
	"../../utils"
		"../../types"
	"reflect"
)

type I_ldc2W struct {
}

func init()  {
	INSTRUCTION_MAP[0x14] = &I_ldc2W{}
}

func (s I_ldc2W)Stroke(ctx *runtime.Context) error {
	utils.Log(1, "ldc2W exce >>>>>>>>>\n")

	index := uint16(ctx.Code[ctx.PC]) << 8 | uint16(ctx.Code[ctx.PC + 1])
	ctx.PC += 2

	ctx.CurrentFrame.PushFrame(ctx.Clazz.GetConstantValue(index))
	return nil
}

func (s I_ldc2W)Test(octx *runtime.Context) *runtime.Context {
	f := new(runtime.Frame)
	f.PushFrame(&types.Jarray{
		ElementJype: reflect.TypeOf(types.Jlong(0)),
		Reference: []interface{}{1, 2, 3, 4},
	})
	f.PushFrame(types.Jlong(2))
	f.PushFrame(types.Jlong(6))

	a := new(runtime.Aborigines)
	a.Layers = append(a.Layers, &[]uint32{1234})
	return &runtime.Context{
		Code: []byte{0x0},
		CurrentFrame: f,
		CurrentAborigines: a,
	}
}
/**
======================================================================================
		操作				||		从运行时常量池中提取 long 或 double 数据推入操作数栈(宽索引)
======================================================================================
						||		ldc2W
						||------------------------------------------------------------
						||		indexbyte1
						||------------------------------------------------------------
						||		indexbyte2
		格式				||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
======================================================================================
		结构				||		ldc2_w = 20(0x14)
======================================================================================
						||		... →
	   操作数栈			||------------------------------------------------------------
						||		...，result
======================================================================================
						||		
		描述				||		无符号数 indexbyte1 和 indexbyte2 用于构建一个当前类(§2.6)的运 行时常量池的索引值，构建方式为(indexbyte1 << 8)| indexbyte2，
该索引所指向的运行时常量池项应当是一个 long 或者 double 类型的运行时 常量(§5.1)。数值这个常量所对应的数值将被压入到操作数栈之中。

======================================================================================
						||		
						||
	   运行时异常			||
						||	在类的符号解析阶段，任何在§5.4.3.1 章节中描述的异常都可能被抛出。
						||		
						||		
======================================================================================
						||
						||
	   运行时异常			||
						||
						||
						||
======================================================================================
						||
		注意				||
						||		只有宽索引版本的 ldc2_w 指令，不存在单 byte 类型索引的 ldc2 指令用于 从运行时常量池中提取 long 或 double 数据推入操作数栈。
ldc2_w 指令只能用来处理双精度浮点集合(§2.3.2)中的 double 类型数 据，因为常量池(§4.4.5)中 double 类型的常量必须从双精度浮点集合中 选取。
						||
						||
======================================================================================
 */