package instructions

import (
	"../runtime"
	"../../utils"
	"../../types"
		)

type I_pop2 struct {
}

func init()  {
	INSTRUCTION_MAP[0x58] = &I_pop2{}
}

func (s I_pop2)Stroke(ctx *runtime.Context) error {
	utils.Log(1, "pop2 exce >>>>>>>>>\n")
	value, _ := ctx.CurrentFrame.PopFrame()
	if !runtime.IsDoubleLong(value) {
		value2, _ := ctx.CurrentFrame.PeekFrame()
		if runtime.IsDoubleLong(value2) {
			panic("pop2 value2 is double>>>>>>>>>>>>>>>>>>>>>>>")
		}
		ctx.CurrentFrame.PopFrame()
	}
	return nil
}

func (s I_pop2)Test(octx *runtime.Context) *runtime.Context {
	f := new(runtime.Frame)
	f.PushFrame(&types.Jarray{
		Reference: []types.Jbyte{1, 2, 3, 4},
	})
	f.PushFrame(types.Jfloat(9.123456789012345))
	f.PushFrame(types.Jint(9))
	a := new(runtime.Aborigines)
	a.Layers = append(a.Layers, &[]uint32{1234})
	return &runtime.Context{
		Code: []byte{0x0},
		CurrentFrame: f,
		CurrentAborigines: a,
	}
}
/**
======================================================================================
		操作				||		将操作数栈的栈顶一个或两个元素出栈
======================================================================================
						||		pop2
						||------------------------------------------------------------
						||
						||------------------------------------------------------------
						||		
		格式				||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
						||------------------------------------------------------------
						||		
======================================================================================
		结构				||		pop2 = 88(0x58)
======================================================================================
						||		...，value2，value1 →
	   操作数栈			||-----------------------------这时候 value1 和 value2 都必须为(§2.11.1)中定义的分类一的运算类 型。
						||		...，
======================================================================================
						||		...，value →
	   操作数栈			||-----------------------------这时候 value 必须为(§2.11.1)中定义的分类二的运算类型。
						||		...，
======================================================================================
						||
		描述				||		将操作数栈的栈顶一个或两个元素出栈。
						||
======================================================================================
						||		
						||
						||
	   运行时异常			||
						||		
						||		
						||		
======================================================================================
						||
						||
						||
		注意				||
						||
						||
						||
======================================================================================
 */